'use strict';
let number = 10;
/*const leftBorderWidth = 1;
number = 3;*/
console.log(number);

//________________________________________
/*
let incriment = 10,
    decriment = 10;
*/


// постфиксная запись ++ и -- в конце:
/*incriment++; // увеличение на 1
decriment--; // уменьшение на 1
console.log(`постфиксная запись ++ в конце, значение равно: ${incriment}`); // 11
console.log(`постфиксная запись -- в конце, значение равно: ${decriment}`); // 9 */

// префиксная запись ++ и -- в начале:
/*++incriment; // увеличение на 1
--decriment; // уменьшение на 1
console.log(`префиксная запись ++ в начале, значение равно: ${incriment}`); // 11
console.log(`префиксная запись -- в начале, значение равно: ${decriment}`); // 9  */

// постфиксная запись ++ и -- в конце прямо когда используем:
/*console.log(`постфиксная запись ++ в конце прямо когда используем,
значение равно: ${incriment++}`); // постфиксная запись сначала возвращает старое знач-е --- 10
console.log(`постфиксная запись -- в конце прямо когда используем,
значение равно: ${decriment--}`); // 10  */

// префиксная запись ++ и -- в начале прямо когда используем:
/*console.log(`префиксная запись ++ в начале прямо когда используем,
значение равно: ${++incriment}`); // префиксная запись сначала возвращает старое знач-е --- 11
console.log(`префиксная запись -- в начале прямо когда используем, 
значение равно: ${--decriment}`); //  9  */

